[{"videos":[],"languageBranch":"en","id":"add","name":"Add"},{"description":"To mix a frozen daiquiri or margeritas you need a blender. Start by putting ice cubes in the blender. The result will be much more smooth if you use crushed ice instead. Then add base spirit and the rest of the ingredients. Blend until smooth.Pour the drink into a cocktail or wine glass. With this knowledge you can easily make a Frozen Margarita","videos":[{"video":"blend.mp4","type":"assets"}],"languageBranch":"en","id":"blend","name":"Blend"},{"videos":[],"tool":{"id":"freezer","text":"Freezer"},"languageBranch":"en","id":"chill","name":"Chill"},{"videos":[],"languageBranch":"en","id":"fill","name":"Fill"},{"description":"To make liquid float is done by carefully pouring a small amount of liquid that balances as the top layer of a drink.Use the back of a barspoon to gently disperse the ingredient on top of the ingredients already in the glass. This technique is often used to to make layered shots and works best when you mix heavier and lighter liquor. The heavier, of course, sinks while the lighter rises. To maintain the layering effect the drink should not be stirred. Practice is the best way to get the feel for creating clean layers, so start now and soon you will become a true cocktail magician.","videos":[],"tool":{"id":"barspoon","text":"Barspoon"},"languageBranch":"en","id":"float","name":"Float"},{"videos":[],"languageBranch":"en","id":"garnish","name":"Garnish"},{"description":"The muddling technic is used to squeeze the flavour out of fresh fruit or berries. You need a muddler, but a kitchen tool with a blunt end (like a pestle) works as well. Put bits of fresh fruit or berries into a glass and squeeze it with the muddler until all juices are out. If you muddle with sugar, work until the sugar starts to dissolve in the juices.  With this method you can mix Mojito or Absolut Blackberry fruitini.","videos":[{"video":"muddle.mp4","type":"assets"}],"tool":{"id":"muddler","text":"Muddler"},"languageBranch":"en","id":"muddle","name":"Muddle"},{"videos":[],"languageBranch":"en","id":"pour","name":"Pour"},{"description":"Why shake? Well, you use a shaker because you want to chill and mix your drinks. There are two types of shakers, the boston shaker and the cobbler shaker. They share the same function and it is a matter of taste which one to use. The boston shaker is more common in bars. With this type of shaker you will need a additional strainer, which on the other hand is built into the cobbler shaker.   Fill the shaker with ice cubes and all ingredients. Mount the lid on the cobbler shaker or the tin part in case you have a boston shaker. Hold the shaker together and shake until the tin part is misty. Strain the fluid into a glass. Remember not to shake carbonated or hot liquids. Also, it is a golden rule NOT to shake in the direction of any of your guests. Mastering the shake will give you the skills to make an ABSOLUT Cosmopolitan.","videos":[{"video":"shake.mp4","type":"assets"}],"languageBranch":"en","id":"shake","name":"Shake"},{"description":"You can mix and chill a drink by stirring it with ice cubes. This will keep the drink transparent and clear. You need a mixing glass and a bar spoon (long spoon). Fill the mixing glass with ice cubes and add all the ingredients. Stir gentle until the liquids are properly mixed and chilled. Put a strainer on the mixing glass and strain into a cocktail glass. Normally you make martinis like Dry Martini and Absolut Gibson using this method.","videos":[{"video":"stir.mp4","type":"assets"}],"tool":{"id":"barspoon","text":"Barspoon"},"languageBranch":"en","id":"stir","name":"Stir"},{"description":"Shaking and straining complement each other like ebony and ivory or like blueberries and milk. The strain method separates your drink from the ice and possible ingredients that you do not want ending up in your drink, like for example fruit pits, or pulp. Straining makes your drink look clean and crisp and enables your exceptional cocktail experience.","videos":[],"tool":{"id":"strainer","text":"Strainer"},"languageBranch":"en","id":"strain","name":"Strain"},{"description":"","videos":[],"languageBranch":"en","id":"topup","name":"Top up"}]