[{"id":"champagne-glass","description":"The most luxurious of all glasses holds around 5 fl oz. (150 milliliters). Most often used for sparkling drinks it has other uses as well. In the Champagne glass you can serve Absolut 50/50 or Absolut Ruby Red Celebration. A nice, beautiful glass to have at home, \"just in case\".","videos":[{"video":"champagne-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Champagne Glass"},{"id":"cocktail-glass","description":"The reason for the long \"leg\" is to keep the cocktail cold by not exposing the glass to warming hands. Size varies, ","videos":[{"video":"cocktail-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Cocktail Glass"},{"id":"highball-glass","description":"This glass is also called a Collins glass. The highball glass is probably the most used type of drink glass nowadays. Usually it holds around 7 fl oz. (200 milliliters) and is used for many \"regular\" drinks such as Vodka Tonic and ABSOLUT RUBY Seabreeze.","videos":[{"video":"highball-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Highball Glass"},{"id":"rocks-glass","description":"This straight, short glass is sometimes called old-fashioned tumbler or quite simply a whiskey glass. Holds around 7 fl oz. (200 milliliters), and is used for short drinks and straight spirits on the rocks. Hence the name. And hey, want a superb drink for your Rocks glass? Go with the ABSOLUT Vodka Gimlet","videos":[{"video":"rocks-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Rocks Glass"},{"id":"shot-glass","description":"The smallest glass in the family is mainly used for serving. It can also come in handy as a measuring glass as it holds 1.5-2 fl oz. (40-60 milliliters). Sometimes called a shooter or a pony glass. Want a classic with a twist? Try the World's Fastest Bloody Mary.","videos":[{"video":"shot-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Shot Glass"},{"id":"wine-glass","description":"There are more uses for this glass, than the name reveals. Wine glasses are great for frozen drinks, wine coolers, some champagne drinks etc. These glasses come in all sizes, but 8-11 fl oz. (230-325 milliliters) is a good volume when making drinks. In the wine glass you can serve Absolut Hot Sweet and Spicy or a Frozen Margarita.","videos":[{"video":"wine-glass.mp4","type":"assets"}],"languageBranch":"en","name":"Wine Glass"}]