[{"description":"Typically with a spiral handle (for easy twisting of the shaft) and a small spoon bowl with holes (for floating liquors) the barspoon is essential for stirring and layering drinks. It is also helpful when fishing cherries out of a jar. Once you have used a bar spoon you will never manage without one when making drinks.","videos":[{"video":"barspoon.mp4","type":"assets"}],"languageBranch":"en","id":"barspoon","name":"Barspoon"},{"description":"An electric mixer, or blender, is a good thing to have when making frozen drinks. Or experimenting with milkshakes, for that matter. Using crushed ice in the machine make the drinks smoother.","videos":[{"video":"blender.mp4","type":"assets"}],"languageBranch":"en","id":"blender","name":"Blender"},{"description":"The boston shaker is used to mix as well as chill the drink ingredients. It consists of two parts, a mixing glass and a tin glass.\r\n\r\nFill ice and liquids in the mixing glass. Put the tin part on top of the mixing glass. Then press it lightly to make sure there is no gap between it and the glass. Shake. You need an additional strainer to trickle the mixed drink into a glass.","videos":[{"video":"boston-shaker.mp4","type":"assets"}],"languageBranch":"en","id":"boston-shaker","name":"Boston Shaker"},{"description":"There are few more frustrating things than not having a bottle opener when you need one. The opener can be compact, even fitting on a keychain, built into another tool or simply installed permanently into your wall or cabinet.\r\n\r\n\r\nThere are many different types of wine openers to choose from, the most popular being the Winged and Waiter's corkscrews.\r\n\r\n\r\nMost liquor bottles don't need a special bottle opener or cork screw. You will probably keep yourself from laughing, though, when a guest shows up at your house with a bottle of Merlot and you have no way to open it. Besides, you may want to mix some \"wine\" drinks. Thus, see to it that you always have a bottle opener at hand.","videos":[],"languageBranch":"en","id":"bottler-wine-opener","name":"Bottler & wine opener"},{"description":"It's tempting to buy ready made juices. But there's no arguing that lemon and lime juice is best when freshly squeezed. Thus, an automatic juice press is a good investment. A manual works just as well, but takes a bit more effort to handle.","videos":[{"video":"citrus-press.mp4","type":"assets"}],"languageBranch":"en","id":"citrus-press","name":"Citrus press"},{"description":"The cobbler shaker has three parts: a tin part, a strainer and a lid. The main advantage is that the strainer is built in. Fill the tin part with ice and ingredients. Put the strainer and lid on. Shake until the tin part is cold and misty. Open the lid and pour the drink into a glass.","videos":[{"video":"cobbler-shaker.mp4","type":"assets"}],"languageBranch":"en","id":"cobbler-shaker","name":"Cobbler Shaker"},{"description":"A freezer is very handy when chilling glasses.  If you have one, skip chilling your cocktail glasses with ice. Shooters and rocks glasses are nice to have pre-chilled too.\r\n\r\nUsing a chilled glass will keep your cocktails crisp and cool longer and adds aesthetics to the final presentation. Even if you only do a quick chill you will never regret using a chilled glass.","videos":[],"languageBranch":"en","id":"freezer","name":"Freezer"},{"description":"You will find both manual and electric ice crushers on the market. The budget alternative, which is a really cool one, is to wrap the ice in a clean towel and pound it with a hammer or similar.","videos":[{"video":"ice-crusher.mp4","type":"assets"}],"languageBranch":"en","id":"ice-crusher","name":"Ice Crusher"},{"description":"Neither you nor your guests want you to poke around with your bare hands in the ice. Use a tool for this as you want your ice as fresh and neat as possible. An ice tray or bucket works well too.","videos":[{"video":"ice-tong.mp4","type":"assets"}],"languageBranch":"en","id":"ice-tong","name":"Ice Tong"},{"description":"Jiggers are metal measuring devices that usually have two cones, one on either end. The larger cone typically holds 1 1/2 ounces while the smaller cone holds 3/4 or 1 ounce.\r\n\r\nThe jigger is an essential, aesthetic piece of the bar set up that ensures the precise measuring of liquids. It also facilitates the making of consistent cocktails. Well, at least for those of us with wobbly hands or poor judgment.","videos":[{"video":"jigger.mp4","type":"assets"}],"languageBranch":"en","id":"jigger","name":"Jigger"},{"description":"A sharp knife for cutting fruit is a must have. If you want your garnishes to look nice you can't do without one. A good cutting board is a good thing to have, too.","videos":[{"video":"knife.mp4","type":"assets"}],"languageBranch":"en","id":"knife","name":"Knife"},{"description":"The mixing glass looks a lot like the glass part of a Boston shaker but is normally wider and bigger. In the mixing glass you stir your Vodkatinis with lots of dry ice, and strain the drink into cocktail glasses.\r\n\r\nThe mixing glass can be replaced with any large, clean, and tall glass vessel.","videos":[{"video":"mixing-glass.mp4","type":"assets"}],"languageBranch":"en","id":"mixing-glass","name":"Mixing glass"},{"description":"Looking like a baseball bat for hedgehogs, the muddler comes in handy whenever you are dealing with fresh herbs or fruits and want the juice out of them.\r\n\r\nThe two most common drinks that require the use of a muddler are the mojito and the caipirinha. When buying a muddler, choose a thicker one with a diameter of about 1 1/2-2 inches at the widest point. The thicker muddlers will give you more crushing and mixing power than the thinner ones.","videos":[{"video":"muddler.mp4","type":"assets"}],"languageBranch":"en","id":"muddler","name":"Muddler"},{"description":"The speed pourer, or bottle pourer, is a luxury item for most home bartenders. It is handy, however, when hosting parties thanks to its ability to pour liquor from the bottles quickly and easily.\r\n\r\n\r\nHere are a few quick tips on how to become a speed pouring master:\r\n\r\n\r\n1. Place the speed pourer in the bottle so that the pouring hole is facing the bottle's label. This way you'll always know in which direction the hole is pointing.\r\n\r\n2. To slow down the pouring rate, use your finger to block the air hole on top of the pourer.\r\n\r\n3. Hold the bottle upside down over the glass and count to three to pour 1 1/2 ounces of liquid. Practice with an empty bottle filled with water and fill a shot glass while counting. After a few times of doing this you will have trained yourself to this rhythm and know exactly how much you've poured.\r\n\r\n4. Never store a bottle for a long time with the speed pourer, since this will cause air to get into the bottle and shorten its shelf life.","videos":[{"video":"pourer.mp4","type":"assets"}],"languageBranch":"en","id":"pourer","name":"Pourer"},{"description":"The bar strainer usually has a spiral on the edge to keep ice cubes and fruit lumps out of your drinks. When you buy a shaker, it’s often delivered with a strainer.\r\n\r\nBut if you're using a Boston shaker you will need to complement it with a strainer because there is not one built in it. If you don’t have a strainer, the regular kitchen variant works as well.","videos":[{"video":"strainer.mp4","type":"assets"}],"languageBranch":"en","id":"strainer","name":"Strainer"},{"description":"When making twists and spirals, everything is much easier with a twist knife. It is also a very handy tool for peeling fruit. Consequently it is sometimes called peeler.","videos":[],"languageBranch":"en","id":"twist-knife","name":"Twist Knife"}]